Description: Downloads the latest version of Visual Studio Code
Identifier: com.csolom.download.VisualStudioCode
MinimumVersion: "2.3"

Input:
  NAME: Visual Studio Code
  DOWNLOAD_URL: https://code.visualstudio.com/sha/download?build=stable&os=darwin-universal-dmg

Process:
  - Processor: URLDownloader
    Arguments:
      filename: "%NAME%.dmg"
      url: "%DOWNLOAD_URL%"

  - Processor: EndOfCheckPhase

  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Visual Studio Code.app/"
      requirement: identifier "com.microsoft.VSCode" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = UBF8T346G9