Description: Creates the pkg for the latest version of Visual Studio Code
Identifier: com.csolom.pkg.VisualStudioCode
MinimumVersion: "2.3"
ParentRecipe: com.csolom.download.VisualStudioCode

Input:
  NAME: Visual Studio Code
  BUNDLE_ID: com.microsoft.VSCode

Process:
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: Unarchiver
    Arguments: 
      archive_path: "%pathname%"
      destination_path: "%pkgroot%/Applications/"
      purge_destination: True
  
  - Processor: Versioner
    Arguments:
      plist_version_key: "CFBundleShortVersionString"
      input_plist_path: "%pkgroot%/Applications/Visual Studio Code.app/Contents/Info.plist"
    
  - Processor: PkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%BUNDLE_ID%"
        options: purge_ds_store
        pkgdir: "%RECIPE_CACHE_DIR%"
        pkgname: "%NAME%-%version%"

